Revit 2024 API
MassSurfaceData.IsGlazingShaded Property
 Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsGlazingShaded { get; set; }
Visual Basic
Public Property IsGlazingShaded As Boolean
	Get
	Set
Visual C++
public:
property bool IsGlazingShaded {
	bool get ();
	void set (bool value);
}
See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace